performance/hc_siege.txt
HYDROCLIENT
** SIEGE 3.0.8
** Preparing 1 concurrent users for battle.
The server is now under siege...      done.

Transactions:		          10 hits
Availability:		      100.00 %
Elapsed time:		        7.20 secs
Data transferred:	        0.22 MB
Response time:		        0.32 secs
Transaction rate:	        1.39 trans/sec
Throughput:		        0.03 MB/sec
Concurrency:		        0.44
Successful transactions:          10
Failed transactions:	           0
Longest transaction:	        0.50
Shortest transaction:	        0.17
 
** SIEGE 3.0.8
** Preparing 2 concurrent users for battle.
The server is now under siege...
Lifting the server siege...-      done.

Transactions:		          96 hits
Availability:		      100.00 %
Elapsed time:		       29.50 secs
Data transferred:	        2.10 MB
Response time:		        0.20 secs
Transaction rate:	        3.25 trans/sec
Throughput:		        0.07 MB/sec
Concurrency:		        0.64
Successful transactions:          96
Failed transactions:	           0
Longest transaction:	        0.46
Shortest transaction:	        0.16